hacker/_posts/2016-08-27-Analyzing Elisp.org
#+OPTIONS: H:2 num:nil tags:nil timestamps:t
#+BEGIN_EXPORT html
---
title: Analyzing Elisp
tagline: Making an Elisp parser just to see what code can be written
layout: post
author: Francis Murillo
categories: Emacs, Hacker
blog-category: hacker
tags: Emacs
---
#+END_EXPORT

* Idea

  I like poetry. It is art and I love it. I like reading. It is writing
  and I love it. So are programmers not writers? Sort of.

  Recently, I just read [[https://www.amazon.com/Your-Code-Crime-Scene-Bottlenecks/dp/1680500384][Your Code As A Crime Scene]] and I am breathless
  on what you can do by analyzing source code. It has practical value in
  getting a project landscape as well as being smarter on how code
  evolves on a project. The concepts such as *coupling*, *churn* and
  *ownership* are really compelling. As such, I am planning to implement
  a [[https://github.com/FrancisMurillo/code-maater.el][code-maater.el]] library so I can practice how to make a major mode in
  Emacs as well as get a grip on how to use [[https://github.com/adamtornhill/code-maat][code-maat]] and its tools.

  This motivated me also to analyze Elisp code as a tribute to it and
  experiment. My fundamental question is: *is there complexity analysis
  in Elisp?* Before you get excited, in all honesty I have no idea what
  I am getting at. Merely creating a parser albeit a simple one for lisp
  is what drove me here. I'm good but not that good.

* Code Ideas

  So here the things I though of when thinking about static Elisp
  analysis

  - *Atom Frequency* ::
       What atoms are in a file. And probably there frequency.
  - *Expression Complexity* ::
       Is there a simple metric involving atoms and depth as a way to
       measure complexity?
  - *Code Manipulation* ::
       Can you manipulate the source tree? A common question and concept.

  With that in mind, I will need a parser and a project to analyze.
  Maybe a shameless plug, I will use my created Elisp parser project
  [[https://github.com/FrancisMurillo/elk.el][elk.el]] and analyze the source code with it. We programmers love the
  meta programming or analysis.

  Again, I have no idea what I'm doing so just enjoy the flow of questions.

* Parser

  So while I was a making this parser, I learned how to use [[https://github.com/cask/cask][cask]] and
  [[https://travis-ci.org/][travis-ci]] to make this project. What I did is to separate the parsing
  module against the token analysis library which I dub [[https://github.com/FrancisMurillo/elk-magic.el][elk-magic.el]] and
  not another shameless plug.

  Since this parser is just something to get me started analyzing source
  code, I did not take the terminology of the facts and figures probably
  right. I know how to implement the parser using recursion. At this
  time, I really don't know what it is called or what I am doing. All I
  expect is a function that accepts a source code and churns out tokens
  in a stream. Such is a functional programmer in me but if I may make
  mistakes in terminology or concept, I would be happy to be corrected.
  I really just want to see what happens in the source code, I am not
  planning to create an interpreter.

  Here are some terminology that I came across.

  - *Tokens* ::
       Everything the source code might be interested in. This is the
       main data type expressed as a plist.
  - *Comment* ::
      Lines starting with =; Comment\n=
  - *Whitespace* ::
       Everything between the tokens
  - *Text* ::
       A text or string if you'd like to call it that ="Hello World"=
  - *Atom* ::
       A symbol or a number, basically what you put in =(atom atom atom)=
  - *Quotes* ::
       The unary expression in Elisp =`back-quoting=, ='quoting= or =#'function-quote=
  - *Expressions* ::
       The s-exp of the source code, recursion is prevalent here.

  I am aware that *Numbers* are not in the list but I do not care about
  the actual data type for this analysis. One could put a mapper on the
  tokens just to analyze what data type an atom would be but I am
  interested in the syntax tokens rather than what they really are and I
  know that is more complicated I needed.

  Honestly, you don't need to care about the problems when I implemented
  the parser but for those interested.

  - *Character Escaping* ::
       Handling =\=, =?= or =?\= made this project harder to implement
       but should have expected that.
  - *Infinite Recursion* ::
       Sometimes the code hangs when there is an error recursively
       tokenizing the code. Unit testing and modularity would have
       helped me a lot in my development time

  And probably more but those two I should have considered while I was
  thinking about it. Beside that, implementation of a recursive parser
  is easy enough but obviously not perfect. After creating the unit
  tests, I am confident enough that it parses source code 90% of the
  time.

  As an experiment, I tried parsing =alert=, =helm-projectile=,
  =prodigy= and my own source code and it doesn't hang and gets it
  right. So with this meaningless parser prelude, let's get into the
  meat of the topic. Source code analysis. All experimental source code
  is in =elk-magic.el= with the tag [[https://github.com/FrancisMurillo/elk-magic.el/tree/analyzing-elisp-post][analyzing-elisp-post]].

