hacker/_posts/2016-08-27-Analyzing Elisp.html
---
title: Analyzing Elisp
tagline: Making an Elisp parser just to see what code can be written
layout: post
author: Francis Murillo
categories: Emacs, Hacker
blog-category: hacker
tags: Emacs
---

<div id="outline-container-org031e1ed" class="outline-2">
<h2 id="org031e1ed">Idea</h2>
<div class="outline-text-2" id="text-org031e1ed">
<p>
I like poetry. It is art and I love it. I like reading. It is writing
and I love it. So are programmers not writers? Sort of.
</p>

<p>
Recently, I just read <a href="https://www.amazon.com/Your-Code-Crime-Scene-Bottlenecks/dp/1680500384">Your Code As A Crime Scene</a> and I am breathless
on what you can do by analyzing source code. It has practical value in
getting a project landscape as well as being smarter on how code
evolves on a project. The concepts such as <b>coupling</b>, <b>churn</b> and
<b>ownership</b> are really compelling. As such, I am planning to implement
a <a href="https://github.com/FrancisMurillo/code-maater.el">code-maater.el</a> library so I can practice how to make a major mode in
Emacs as well as get a grip on how to use <a href="https://github.com/adamtornhill/code-maat">code-maat</a> and its tools.
</p>

<p>
This motivated me also to analyze Elisp code as a tribute to it and
experiment. My fundamental question is: <b>is there complexity analysis
in Elisp?</b> Before you get excited, in all honesty I have no idea what
I am getting at. Merely creating a parser albeit a simple one for lisp
is what drove me here. I'm good but not that good.
</p>
</div>
</div>

<div id="outline-container-org2981e39" class="outline-2">
<h2 id="org2981e39">Code Ideas</h2>
<div class="outline-text-2" id="text-org2981e39">
<p>
So here the things I though of when thinking about static Elisp
analysis
</p>

<dl class="org-dl">
<dt><b>Atom Frequency</b></dt><dd>What atoms are in a file. And probably there frequency.</dd>
<dt><b>Expression Complexity</b></dt><dd>Is there a simple metric involving atoms and depth as a way to
measure complexity?</dd>
<dt><b>Code Manipulation</b></dt><dd>Can you manipulate the source tree? A common question and concept.</dd>
</dl>

<p>
With that in mind, I will need a parser and a project to analyze.
Maybe a shameless plug, I will use my created Elisp parser project
<a href="https://github.com/FrancisMurillo/elk.el">elk.el</a> and analyze the source code with it. We programmers love the
meta programming or analysis.
</p>

<p>
Again, I have no idea what I'm doing so just enjoy the flow of questions.
</p>
</div>
</div>

<div id="outline-container-orgb81bccf" class="outline-2">
<h2 id="orgb81bccf">Parser</h2>
<div class="outline-text-2" id="text-orgb81bccf">
<p>
So while I was a making this parser, I learned how to use <a href="https://github.com/cask/cask">cask</a> and
<a href="https://travis-ci.org/">travis-ci</a> to make this project. What I did is to separate the parsing
module against the token analysis library which I dub <a href="https://github.com/FrancisMurillo/elk-magic.el">elk-magic.el</a> and
not another shameless plug.
</p>

<p>
Since this parser is just something to get me started analyzing source
code, I did not take the terminology of the facts and figures probably
right. I know how to implement the parser using recursion. At this
time, I really don't know what it is called or what I am doing. All I
expect is a function that accepts a source code and churns out tokens
in a stream. Such is a functional programmer in me but if I may make
mistakes in terminology or concept, I would be happy to be corrected.
I really just want to see what happens in the source code, I am not
planning to create an interpreter.
</p>

<p>
Here are some terminology that I came across.
</p>

<dl class="org-dl">
<dt><b>Tokens</b></dt><dd>Everything the source code might be interested in. This is the
main data type expressed as a plist.</dd>
<dt><b>Comment</b></dt><dd>Lines starting with <code>; Comment\n</code></dd>
<dt><b>Whitespace</b></dt><dd>Everything between the tokens</dd>
<dt><b>Text</b></dt><dd>A text or string if you'd like to call it that <code>"Hello World"</code></dd>
<dt><b>Atom</b></dt><dd>A symbol or a number, basically what you put in <code>(atom atom atom)</code></dd>
<dt><b>Quotes</b></dt><dd>The unary expression in Elisp <code>`back-quoting</code>, <code>'quoting</code> or <code>#'function-quote</code></dd>
<dt><b>Expressions</b></dt><dd>The s-exp of the source code, recursion is prevalent here.</dd>
</dl>

<p>
I am aware that <b>Numbers</b> are not in the list but I do not care about
the actual data type for this analysis. One could put a mapper on the
tokens just to analyze what data type an atom would be but I am
interested in the syntax tokens rather than what they really are and I
know that is more complicated I needed.
</p>

<p>
Honestly, you don't need to care about the problems when I implemented
the parser but for those interested.
</p>

<dl class="org-dl">
<dt><b>Character Escaping</b></dt><dd>Handling <code>\</code>, <code>?</code> or <code>?\</code> made this project harder to implement
but should have expected that.</dd>
<dt><b>Infinite Recursion</b></dt><dd>Sometimes the code hangs when there is an error recursively
tokenizing the code. Unit testing and modularity would have
helped me a lot in my development time</dd>
</dl>

<p>
And probably more but those two I should have considered while I was
thinking about it. Beside that, implementation of a recursive parser
is easy enough but obviously not perfect. After creating the unit
tests, I am confident enough that it parses source code 90% of the
time.
</p>

<p>
As an experiment, I tried parsing <code>alert</code>, <code>helm-projectile</code>,
<code>prodigy</code> and my own source code and it doesn't hang and gets it
right. So with this meaningless parser prelude, let's get into the
meat of the topic. Source code analysis. All experimental source code
is in <code>elk-magic.el</code> with the tag <a href="https://github.com/FrancisMurillo/elk-magic.el/tree/analyzing-elisp-post">analyzing-elisp-post</a>.
</p>
</div>
</div>
