hacker/_posts/2016-08-27-Analyzing Elisp.org
* Atom Frequency

  Let's start with a simple list.

  #+BEGIN_SRC emacs-lisp
    (a b c a)
  #+END_SRC

  The main parsing function, =elk-parse=, will yield the hypothetical
  list of tokens or plists. The structure should be evident or reflect
  lisp itself with some extra annotation.

  #+BEGIN_SRC emacs-lisp
    (cl-prettyprint (elk-parse "(a b c)"))

    ;; Too lazy to pretty it properly
    ((:type expression
            :tokens
            ((:type atom
                    :tokens
                    nil
                    :start-pos
                    1
                    :end-pos
                    2
                    :index
                    0
                    :level
                    2
                    :id
                    2
                    :parent-id
                    1
                    :text
                    "a"
                    :data-type
                    symbol)
             (:type whitespace
                    :tokens
                    nil
                    :start-pos
                    2
                    :end-pos
                    3
                    :index
                    1
                    :level
                    2
                    :id
                    3
                    :parent-id
                    1
                    :text
                    " ")
             (:type atom
                    :tokens
                    nil
                    :start-pos
                    3
                    :end-pos
                    4
                    :index
                    2
                    :level
                    2
                    :id
                    4
                    :parent-id
                    1
                    :text
                    "b"
                    :data-type
                    symbol)
             (:type whitespace
                    :tokens
                    nil
                    :start-pos
                    4
                    :end-pos
                    5
                    :index
                    3
                    :level
                    2
                    :id
                    5
                    :parent-id
                    1
                    :text
                    " ")
             (:type atom
                    :tokens
                    nil
                    :start-pos
                    5
                    :end-pos
                    6
                    :index
                    4
                    :level
                    2
                    :id
                    6
                    :parent-id
                    1
                    :text
                    "c"
                    :data-type
                    symbol))
            :start-pos
            0
            :end-pos
            -1
            :index
            0
            :level
            1
            :id
            1
            :parent-id
            0))
  #+END_SRC

  Take your time in guessing the structure of the token because it takes
  too much time to explain. I do want to point your attention to the
  plists with type ='atom=. Given this structure, how do we get all the
  tokens in this list. Do think about it while I present the first code
  from =elk-magic.el=.

  #+BEGIN_SRC emacs-lisp
    (defun elk--select-type (type tokens)
      "Filter tokens by a specified type"
      (funcall (-compose
                (-partial #'-filter
                          (lambda (token)
                            (eq (plist-get token :type) type)))
                #'elk--flatten-tokens)
               tokens))

    (defun elk--extract-atoms (tokens)
      "Get atoms in tokens"
      (funcall (-compose
                (-partial #'-map (-rpartial #'plist-get :text))
                (-partial #'elk--select-type 'atom))
               tokens))


    (cl-prettyprint (elk--extract-atoms (elk-parse "(a b c)")))

    ("a" "b" "c")
  #+END_SRC

  Using the functional style of recursion and mapping, I traverse the
  tree and get the source code text and the function does return an
  expected list that reflects the actual structure of the code. But this
  is not exciting. As promised, let's apply this to =elk.el=. Here is
  the output while I group and sort it by frequency.

  #+BEGIN_SRC emacs-lisp
    (defconst elk-file-url "https://raw.githubusercontent.com/FrancisMurillo/elk.el/analyzing-elisp-post/elk.el")
    (defconst elk-file "~/Downloads/elk.el")

    (require 'f)
    (cl-prettyprint (elk-magic-summarize-atoms (elk-parse (f-read-text elk-file))))

    ;; So here is the token frequency
    (("stream" . 61)
     ("elk--use-stream" . 37)
     ("defun" . 34)
     ("token" . 32)
     ("tokens" . 29)
     ("letter" . 27)
     ("current-char" . 25)
     ("nil" . 24)
     ("text" . 24)
     ("this-char" . 23)
     ("setf" . 22)
     ("lambda" . 18)
     ("start-pos" . 18)
     ("recurser" . 18)
     ("current" . 17)
     ("sub-tokens" . 16)
     ("type" . 14)
     (":tokens" . 13)
     ("when" . 12)
     ("incremented-index" . 10)
     ("not" . 9)
     ("-copy" . 9)
     ("stop" . 8)
     ("elk--create-token" . 8)
     ("end-pos" . 7)
     (":type" . 7)
     ("letrec" . 7)
     ("new-token" . 7)
     ("marked-token" . 7)
     ("lexical-let" . 6)
     ("quote-text" . 6)
     ("expression" . 6)
     ("index" . 5)
     ("command" . 5)
     ("pcase" . 5)
     ("require" . 4)
     ("current-value" . 4)
     ("0" . 4)
     ("&optional" . 4)
     ("t" . 4)
     ("base-value" . 4)
     ("elk--stream-next-p" . 4)
     ("elk--quote-p" . 4)
     ("next-char" . 4)
     ("elk--dispatch-stream-consumers" . 4)
     ("value" . 4)
     ("-map" . 4)
     ("leveled-token" . 4)
     ("_" . 4)
     ("seed" . 4)
     ("indexed-token" . 4)
     ("elk--text-stream" . 3)
     ("current-text" . 3)
     ("text-length" . 3)
     ("increment" . 3)
     ("peek" . 3)
     (":end-pos" . 3)
     ("elk--whitespace-p" . 3)
     ("elk--text-quote-p" . 3)
     ("elk--text-escape-p" . 3)
     ("elk--letter-escape-p" . 3)
     ("elk--atom-letter-p" . 3)
     ("start-letter" . 3)
     ("expression-tokens" . 3)
     (":text" . 3)
     ("level" . 3)
     ("generator" . 3)
     ("texify" . 3)
     ("elk-current-tokens" . 3)
     ("elk" . 2)
     ("elk--stream-consumers" . 2)
     ("elk--consume-whitespace" . 2)
     ("elk--consume-comment" . 2)
     ("elk--consume-text" . 2)
     ("elk--consume-quote" . 2)
     ("elk--consume-atom" . 2)
     ("elk--consume-expression" . 2)
     ("base" . 2)
     ("incrementer" . 2)
     ("default" . 2)
     ("-1" . 2)
     ("elk--stream-stop-p" . 2)
     (":start-pos" . 2)
     ("elk--comment-p" . 2)
     ("elk--newline-p" . 2)
     ("elk--function-quote-p" . 2)
     ("elk--back-quote-p" . 2)
     ("elk--expression-start-p" . 2)
     ("elk--expression-close-p" . 2)
     ("whitespace" . 2)
     ("comment" . 2)
     ("base-token" . 2)
     (":quote-text" . 2)
     ("push" . 2)
     ("handler" . 2)
     ("elk--attach-source" . 2)
     ("elk--attach-level" . 2)
     ("1" . 2)
     ("elk--attach-token-id" . 2)
     ("incremental-sequence" . 2)
     ("start" . 2)
     ("parent-id" . 2)
     (":id" . 2)
     ("elk--attach-expression-index" . 2)
     ("elk--attach-atom-type" . 2)
     ("typer" . 2)
     ("number" . 2)
     ("elk--parsing" . 2)
     ("elk--parse" . 2)
     ("parsing" . 2)
     ("-compose" . 2)
     ("-partial" . 2)
     ("text-tokens" . 2)
     ("source-text" . 2)
     ("cl-lib" . 1)
     ("dash" . 1)
     ("dash-functional" . 1)
     ("s" . 1)
     ("defgroup" . 1)
     (":prefix" . 1)
     (":group" . 1)
     ("tools" . 1)
     (":link" . 1)
     ("url-link" . 1)
     (":tag" . 1)
     ("elk--started-stream" . 1)
     ("s-matches-p" . 1)
     ("unless" . 1)
     (":level" . 1)
     (":parent-id" . 1)
     ("-map-indexed" . 1)
     (":index" . 1)
     ("zerop" . 1)
     ("symbol" . 1)
     (":data-type" . 1)
     ("elk--codify" . 1)
     ("s-join" . 1)
     ("-flatten" . 1)
     ("elk-parse" . 1)
     ("region-active-p" . 1))
  #+END_SRC

  A lot of tokens indeed! So the question is: *what does this tell us?*
  First of, there is already a lot of junk such function
  parameters(=:level=, =&optional=), numbers(=0=, =1=) and other known
  functions(=defun=, =not=). So to say this is expected but again what
  does it mean for a token to be frequent or otherwise?

  Honestly, I don't know. I do want to know what keywords best identify
  a source code. I guess I am merely grasping at straws here. I could
  tighten up the filter for what is a meaningful atom but I could still
  run in the same problem.

  An unoriginal idea would be to create an linter on what keywords or
  names should be allowed such as enforcing a schema but I don't want to
  go there.

  So first idea is a bust.

