hacker/_posts/2016-08-27-Analyzing Elisp.html

<div id="outline-container-org8723e29" class="outline-2">
<h2 id="org8723e29">Atom Frequency</h2>
<div class="outline-text-2" id="text-org8723e29">
<p>
Let's start with a simple list.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>a b c a<span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
The main parsing function, <code>elk-parse</code>, will yield the hypothetical
list of tokens or plists. The structure should be evident or reflect
lisp itself with some extra annotation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>elk-parse <span style="color: #68f6cb;">"(a b c)"</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Too lazy to pretty it properly</span>
<span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-style: italic;">:type</span> expression
        <span style="color: #96a5d9; font-style: italic;">:tokens</span>
        <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-style: italic;">:type</span> atom
                <span style="color: #96a5d9; font-style: italic;">:tokens</span>
                nil
                <span style="color: #96a5d9; font-style: italic;">:start-pos</span>
                1
                <span style="color: #96a5d9; font-style: italic;">:end-pos</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:index</span>
                0
                <span style="color: #96a5d9; font-style: italic;">:level</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:id</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:parent-id</span>
                1
                <span style="color: #96a5d9; font-style: italic;">:text</span>
                <span style="color: #68f6cb;">"a"</span>
                <span style="color: #96a5d9; font-style: italic;">:data-type</span>
                symbol<span style="color: #00bfff;">)</span>
         <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-style: italic;">:type</span> whitespace
                <span style="color: #96a5d9; font-style: italic;">:tokens</span>
                nil
                <span style="color: #96a5d9; font-style: italic;">:start-pos</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:end-pos</span>
                3
                <span style="color: #96a5d9; font-style: italic;">:index</span>
                1
                <span style="color: #96a5d9; font-style: italic;">:level</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:id</span>
                3
                <span style="color: #96a5d9; font-style: italic;">:parent-id</span>
                1
                <span style="color: #96a5d9; font-style: italic;">:text</span>
                <span style="color: #68f6cb;">" "</span><span style="color: #00bfff;">)</span>
         <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-style: italic;">:type</span> atom
                <span style="color: #96a5d9; font-style: italic;">:tokens</span>
                nil
                <span style="color: #96a5d9; font-style: italic;">:start-pos</span>
                3
                <span style="color: #96a5d9; font-style: italic;">:end-pos</span>
                4
                <span style="color: #96a5d9; font-style: italic;">:index</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:level</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:id</span>
                4
                <span style="color: #96a5d9; font-style: italic;">:parent-id</span>
                1
                <span style="color: #96a5d9; font-style: italic;">:text</span>
                <span style="color: #68f6cb;">"b"</span>
                <span style="color: #96a5d9; font-style: italic;">:data-type</span>
                symbol<span style="color: #00bfff;">)</span>
         <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-style: italic;">:type</span> whitespace
                <span style="color: #96a5d9; font-style: italic;">:tokens</span>
                nil
                <span style="color: #96a5d9; font-style: italic;">:start-pos</span>
                4
                <span style="color: #96a5d9; font-style: italic;">:end-pos</span>
                5
                <span style="color: #96a5d9; font-style: italic;">:index</span>
                3
                <span style="color: #96a5d9; font-style: italic;">:level</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:id</span>
                5
                <span style="color: #96a5d9; font-style: italic;">:parent-id</span>
                1
                <span style="color: #96a5d9; font-style: italic;">:text</span>
                <span style="color: #68f6cb;">" "</span><span style="color: #00bfff;">)</span>
         <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-style: italic;">:type</span> atom
                <span style="color: #96a5d9; font-style: italic;">:tokens</span>
                nil
                <span style="color: #96a5d9; font-style: italic;">:start-pos</span>
                5
                <span style="color: #96a5d9; font-style: italic;">:end-pos</span>
                6
                <span style="color: #96a5d9; font-style: italic;">:index</span>
                4
                <span style="color: #96a5d9; font-style: italic;">:level</span>
                2
                <span style="color: #96a5d9; font-style: italic;">:id</span>
                6
                <span style="color: #96a5d9; font-style: italic;">:parent-id</span>
                1
                <span style="color: #96a5d9; font-style: italic;">:text</span>
                <span style="color: #68f6cb;">"c"</span>
                <span style="color: #96a5d9; font-style: italic;">:data-type</span>
                symbol<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
        <span style="color: #96a5d9; font-style: italic;">:start-pos</span>
        0
        <span style="color: #96a5d9; font-style: italic;">:end-pos</span>
        -1
        <span style="color: #96a5d9; font-style: italic;">:index</span>
        0
        <span style="color: #96a5d9; font-style: italic;">:level</span>
        1
        <span style="color: #96a5d9; font-style: italic;">:id</span>
        1
        <span style="color: #96a5d9; font-style: italic;">:parent-id</span>
        0<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Take your time in guessing the structure of the token because it takes
too much time to explain. I do want to point your attention to the
plists with type <code>'atom</code>. Given this structure, how do we get all the
tokens in this list. Do think about it while I present the first code
from <code>elk-magic.el</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">elk--select-type</span> <span style="color: #ff1493;">(</span>type tokens<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"Filter tokens by a specified type"</span>
  <span style="color: #ff1493;">(</span>funcall <span style="color: #7fff00;">(</span>-compose
            <span style="color: #00bfff;">(</span>-partial #'-filter
                      <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>token<span style="color: #da70d6;">)</span>
                        <span style="color: #da70d6;">(</span>eq <span style="color: #00ff7f;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:type</span><span style="color: #00ff7f;">)</span> type<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
            #'elk--flatten-tokens<span style="color: #7fff00;">)</span>
           tokens<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">elk--extract-atoms</span> <span style="color: #ff1493;">(</span>tokens<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"Get atoms in tokens"</span>
  <span style="color: #ff1493;">(</span>funcall <span style="color: #7fff00;">(</span>-compose
            <span style="color: #00bfff;">(</span>-partial #'-map <span style="color: #ffff00;">(</span>-rpartial #'plist-get <span style="color: #96a5d9; font-style: italic;">:text</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
            <span style="color: #00bfff;">(</span>-partial #'elk--select-type 'atom<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
           tokens<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>


<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>elk--extract-atoms <span style="color: #7fff00;">(</span>elk-parse <span style="color: #68f6cb;">"(a b c)"</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #68f6cb;">"a"</span> <span style="color: #68f6cb;">"b"</span> <span style="color: #68f6cb;">"c"</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Using the functional style of recursion and mapping, I traverse the
tree and get the source code text and the function does return an
expected list that reflects the actual structure of the code. But this
is not exciting. As promised, let's apply this to <code>elk.el</code>. Here is
the output while I group and sort it by frequency.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defconst</span> <span style="color: #ff694d;">elk-file-url</span> <span style="color: #68f6cb;">"https://raw.githubusercontent.com/FrancisMurillo/elk.el/analyzing-elisp-post/elk.el"</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defconst</span> <span style="color: #ff694d;">elk-file</span> <span style="color: #68f6cb;">"~/Downloads/elk.el"</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">f</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>elk-magic-summarize-atoms <span style="color: #7fff00;">(</span>elk-parse <span style="color: #00bfff;">(</span>f-read-text elk-file<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">So here is the token frequency</span>
<span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"stream"</span> . 61<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--use-stream"</span> . 37<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"defun"</span> . 34<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"token"</span> . 32<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"tokens"</span> . 29<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"letter"</span> . 27<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"current-char"</span> . 25<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"nil"</span> . 24<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"text"</span> . 24<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"this-char"</span> . 23<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"setf"</span> . 22<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"lambda"</span> . 18<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"start-pos"</span> . 18<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"recurser"</span> . 18<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"current"</span> . 17<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"sub-tokens"</span> . 16<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"type"</span> . 14<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":tokens"</span> . 13<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"when"</span> . 12<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"incremented-index"</span> . 10<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"not"</span> . 9<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"-copy"</span> . 9<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"stop"</span> . 8<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--create-token"</span> . 8<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"end-pos"</span> . 7<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":type"</span> . 7<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"letrec"</span> . 7<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"new-token"</span> . 7<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"marked-token"</span> . 7<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"lexical-let"</span> . 6<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"quote-text"</span> . 6<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"expression"</span> . 6<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"index"</span> . 5<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"command"</span> . 5<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"pcase"</span> . 5<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"require"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"current-value"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"0"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"&amp;optional"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"t"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"base-value"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--stream-next-p"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--quote-p"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"next-char"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--dispatch-stream-consumers"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"value"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"-map"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"leveled-token"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"_"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"seed"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"indexed-token"</span> . 4<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--text-stream"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"current-text"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"text-length"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"increment"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"peek"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":end-pos"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--whitespace-p"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--text-quote-p"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--text-escape-p"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--letter-escape-p"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--atom-letter-p"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"start-letter"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"expression-tokens"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":text"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"level"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"generator"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"texify"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk-current-tokens"</span> . 3<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--stream-consumers"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--consume-whitespace"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--consume-comment"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--consume-text"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--consume-quote"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--consume-atom"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--consume-expression"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"base"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"incrementer"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"default"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"-1"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--stream-stop-p"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":start-pos"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--comment-p"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--newline-p"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--function-quote-p"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--back-quote-p"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--expression-start-p"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--expression-close-p"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"whitespace"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"comment"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"base-token"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":quote-text"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"push"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"handler"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--attach-source"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--attach-level"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"1"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--attach-token-id"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"incremental-sequence"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"start"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"parent-id"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":id"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--attach-expression-index"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--attach-atom-type"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"typer"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"number"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--parsing"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--parse"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"parsing"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"-compose"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"-partial"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"text-tokens"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"source-text"</span> . 2<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"cl-lib"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"dash"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"dash-functional"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"s"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"defgroup"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":prefix"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":group"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"tools"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":link"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"url-link"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":tag"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--started-stream"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"s-matches-p"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"unless"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":level"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":parent-id"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"-map-indexed"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":index"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"zerop"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"symbol"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">":data-type"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk--codify"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"s-join"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"-flatten"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"elk-parse"</span> . 1<span style="color: #ff1493;">)</span>
 <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"region-active-p"</span> . 1<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
A lot of tokens indeed! So the question is: <b>what does this tell us?</b>
First of, there is already a lot of junk such function
parameters(<code>:level</code>, <code>&amp;optional</code>), numbers(<code>0</code>, <code>1</code>) and other known
functions(<code>defun</code>, <code>not</code>). So to say this is expected but again what
does it mean for a token to be frequent or otherwise?
</p>

<p>
Honestly, I don't know. I do want to know what keywords best identify
a source code. I guess I am merely grasping at straws here. I could
tighten up the filter for what is a meaningful atom but I could still
run in the same problem.
</p>

<p>
An unoriginal idea would be to create an linter on what keywords or
names should be allowed such as enforcing a schema but I don't want to
go there.
</p>

<p>
So first idea is a bust.
</p>
</div>
</div>
