hacker/_posts/2016-08-27-Analyzing Elisp.org
* Expression Complexity

  This is another wild idea but the gist is that *given an s-exp, is
  there a metric to compute complexity?* I am not computer science
  professor but a simple metric can go like this and remember atoms have
  a level property.

  #+BEGIN_SRC emacs-lisp
    (defun elk-magic--token-depth (token)
      "Find out the TOKEN depth or the maximum number of level it has."
      (letrec ((recurser
           (lambda (token)
             (let* ((token-level (plist-get token :level))
                 (sub-tokens (plist-get token :tokens))
                 (sub-token-depths
                  (-map recurser sub-tokens)))
               (if sub-token-depths
                   (-max sub-token-depths)
                 token-level)))))
        (funcall recurser token)))

    (defun elk-magic--token-atoms (token)
      "Find out the TOKEN child atoms up to the last depth."
      (letrec ((recurser
           (lambda (token)
             (let* ((token-type (plist-get token :type))
                 (sub-tokens (plist-get token :tokens)))
               (if (eq token-type 'atom)
                   (list token)
                 (apply #'append (-map recurser sub-tokens)))))))
        (funcall recurser token)))


    (defun elk-magic--token-complexity (token)
      "Compute expression or TOKEN complexity."
      (let* ((atoms (elk-magic--token-atoms token))
          (root-level (plist-get token :level))
          (atom-complexity (/ (float (length atoms)))))
        (-sum
         (-map (lambda (atom)
                 (let* ((depth (- (plist-get atom :level) root-level))
                     (depth-complexity depth))
                   (* atom-complexity depth-complexity)))
               atoms))))
  #+END_SRC

  In short, the sum of =((/ number-of-tokens) * (/ current-atom-level
  main-expression-level))=. The idea is weighted atom levels. By giving
  each atom a weight based on the number of atoms in total and factoring
  in on how nested that atom is, it should be a good guess of
  complexity. I guess. So for a quick gist, let's apply it to the
  snippet above.

  #+BEGIN_SRC emacs-lisp
    ;; Code from above
    (defconst snippet-code (buffer-substring-no-properties (region-beginning) (region-end)))

    (cl-prettyprint (mapcar #'elk-magic--token-complexity (elk-parse snippet-code)))

    ;; 0 are the whitespace, whitespace has no complexity or is there?
    (0
     6.357142857142854 ; elk-magic--token-depth
     0
     6.599999999999997 ; elk-magic--token-atoms
     0
     5.727272727272726 ; elk-magic--token-complexity
     )
  #+END_SRC

  Again what does a 5 or 6 tell us? We need more context.

  #+BEGIN_SRC emacs-lisp
    ;; A normal list
    (cl-prettyprint (mapcar #'elk-magic--token-complexity
                            (elk-parse "(1 2 3 4)")))
    ; Result
    (1.0)

    (cl-prettyprint (mapcar #'elk-magic--token-complexity
                            (elk-parse "'a-regular-atom")))
    ; Result
    (1.0) ; Baseline


    ;; A require
    (cl-prettyprint (mapcar #'elk-magic--token-complexity
                            (elk-parse "(require 'elk)")))
    ; Result
    (1.5)


    ;; A normal function
    (cl-prettyprint (mapcar #'elk-magic--token-complexity
                            (elk-parse "(defun hello-elk () (interactive) (message \"Hello Elk\"))")))
    ; Result
    (1.5)


    ;; A battle of recursion
    (require 'subr-x)
    (cl-prettyprint (mapcar #'elk-magic--token-complexity
                            (elk-parse (string-trim-left "
    (defun factorial-linear (n)
      (interactive)
      (let ((value 1)
            (counter 1 ))
        (while (<= counter n)
          (setf value (* value counter))
          (setf counter (1+ counter)))))"))))
    ; Result
    (3.6363636363636376) ; Impretive is not that complicated

    (cl-prettyprint (mapcar #'elk-magic--token-complexity
                            (elk-parse (string-trim-left "
    (defun factorial-recursive (n)
      (interactive)
      (if (zerop n) 1
        (* n (factorial-recursive (1- n))))
      )"))))
    ; Result
    (2.769230769230769) ; Functional is less complicated!?


    ;; Very nested
    (cl-prettyprint (mapcar #'elk-magic--token-complexity
                            (elk-parse (string-trim-left "
    (1 (2 (3 (4 (5 (6 (7 (8 (9 (10 (11 (12 (13 (14 (15 (16))))))))))))))))"))))
    ; Result
    (8.5) ; Complicated indeed
  #+END_SRC

  So the results are more encouraging than the previous but again what
  does this tell us? I still don't know but here is what I think.

  - *If it is around 1 to 5*, the code is considered *simple*
  - *If it is around 6 to 8*, the code is *non-trivial*
  - *Anything higher than 8*, the code is *complex*

  The case may vary and no one can really say if the code should be
  complex or simple, that is in experience but having a simple metric is
  kinda nice. I do want to say that this metric has its flaws and can be
  faked but again it is nice. One can compute the average complexity of
  a code and then track it over time or simply get the a static
  complexity landscape. Or one can just do an ocular and say this code
  needs refactoring. Nothing beats experience I think.

  Quite encouraging for a simple experiment. I say as well that this
  might beat whitespace analysis if people prefer condensed code. I
  don't know but for now this is good.

