hacker/_posts/2016-08-27-Analyzing Elisp.html

<div id="outline-container-org3fc724c" class="outline-2">
<h2 id="org3fc724c">Expression Complexity</h2>
<div class="outline-text-2" id="text-org3fc724c">
<p>
This is another wild idea but the gist is that <b>given an s-exp, is
there a metric to compute complexity?</b> I am not computer science
professor but a simple metric can go like this and remember atoms have
a level property.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">elk-magic--token-depth</span> <span style="color: #ff1493;">(</span>token<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"Find out the TOKEN depth or the maximum number of level it has."</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">letrec</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>recurser
       <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>token<span style="color: #da70d6;">)</span>
         <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>token-level <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:level</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>sub-tokens <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:tokens</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>sub-token-depths
              <span style="color: #9cb6ad;">(</span>-map recurser sub-tokens<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
           <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">if</span> sub-token-depths
               <span style="color: #ff8247;">(</span>-max sub-token-depths<span style="color: #ff8247;">)</span>
             token-level<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>funcall recurser token<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">elk-magic--token-atoms</span> <span style="color: #ff1493;">(</span>token<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"Find out the TOKEN child atoms up to the last depth."</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">letrec</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>recurser
       <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>token<span style="color: #da70d6;">)</span>
         <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>token-type <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:type</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>sub-tokens <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:tokens</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
           <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">if</span> <span style="color: #ff8247;">(</span>eq token-type 'atom<span style="color: #ff8247;">)</span>
               <span style="color: #ff8247;">(</span>list token<span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>apply #'append <span style="color: #9cb6ad;">(</span>-map recurser sub-tokens<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>funcall recurser token<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>


<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">elk-magic--token-complexity</span> <span style="color: #ff1493;">(</span>token<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"Compute expression or TOKEN complexity."</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>atoms <span style="color: #ffff00;">(</span>elk-magic--token-atoms token<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>root-level <span style="color: #ffff00;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:level</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>atom-complexity <span style="color: #ffff00;">(</span>/ <span style="color: #da70d6;">(</span>float <span style="color: #00ff7f;">(</span>length atoms<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>-sum
     <span style="color: #00bfff;">(</span>-map <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>atom<span style="color: #da70d6;">)</span>
             <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>depth <span style="color: #9cb6ad;">(</span>- <span style="color: #ff8c00;">(</span>plist-get atom <span style="color: #96a5d9; font-style: italic;">:level</span><span style="color: #ff8c00;">)</span> root-level<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
                 <span style="color: #ff8247;">(</span>depth-complexity depth<span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
               <span style="color: #00ff7f;">(</span>* atom-complexity depth-complexity<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
           atoms<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
In short, the sum of <code>((/ number-of-tokens) * (/ current-atom-level
  main-expression-level))</code>. The idea is weighted atom levels. By giving
each atom a weight based on the number of atoms in total and factoring
in on how nested that atom is, it should be a good guess of
complexity. I guess. So for a quick gist, let's apply it to the
snippet above.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Code from above</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defconst</span> <span style="color: #ff694d;">snippet-code</span> <span style="color: #ff1493;">(</span>buffer-substring-no-properties <span style="color: #7fff00;">(</span>region-beginning<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span>region-end<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>mapcar #'elk-magic--token-complexity <span style="color: #7fff00;">(</span>elk-parse snippet-code<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">0 are the whitespace, whitespace has no complexity or is there?</span>
<span style="color: #ff8c00;">(</span>0
 6.357142857142854 <span style="color: #2872b2;">; </span><span style="color: #2872b2;">elk-magic--token-depth</span>
 0
 6.599999999999997 <span style="color: #2872b2;">; </span><span style="color: #2872b2;">elk-magic--token-atoms</span>
 0
 5.727272727272726 <span style="color: #2872b2;">; </span><span style="color: #2872b2;">elk-magic--token-complexity</span>
 <span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Again what does a 5 or 6 tell us? We need more context.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2872b2;">;; </span><span style="color: #2872b2;">A normal list</span>
<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>mapcar #'elk-magic--token-complexity
                        <span style="color: #7fff00;">(</span>elk-parse <span style="color: #68f6cb;">"(1 2 3 4)"</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Result</span>
<span style="color: #ff8c00;">(</span>1.0<span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>mapcar #'elk-magic--token-complexity
                        <span style="color: #7fff00;">(</span>elk-parse <span style="color: #68f6cb;">"'a-regular-atom"</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Result</span>
<span style="color: #ff8c00;">(</span>1.0<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">Baseline</span>


<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">A require</span>
<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>mapcar #'elk-magic--token-complexity
                        <span style="color: #7fff00;">(</span>elk-parse <span style="color: #68f6cb;">"(require 'elk)"</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Result</span>
<span style="color: #ff8c00;">(</span>1.5<span style="color: #ff8c00;">)</span>


<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">A normal function</span>
<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>mapcar #'elk-magic--token-complexity
                        <span style="color: #7fff00;">(</span>elk-parse <span style="color: #68f6cb;">"(defun hello-elk () (interactive) (message \"Hello Elk\"))"</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Result</span>
<span style="color: #ff8c00;">(</span>1.5<span style="color: #ff8c00;">)</span>


<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">A battle of recursion</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">subr-x</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>mapcar #'elk-magic--token-complexity
                        <span style="color: #7fff00;">(</span>elk-parse <span style="color: #00bfff;">(</span>string-trim-left <span style="color: #68f6cb;">"</span>
<span style="color: #68f6cb;">(defun factorial-linear (n)</span>
<span style="color: #68f6cb;">  (interactive)</span>
<span style="color: #68f6cb;">  (let ((value 1)</span>
<span style="color: #68f6cb;">        (counter 1 ))</span>
<span style="color: #68f6cb;">    (while (&lt;= counter n)</span>
<span style="color: #68f6cb;">      (setf value (* value counter))</span>
<span style="color: #68f6cb;">      (setf counter (1+ counter)))))"</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Result</span>
<span style="color: #ff8c00;">(</span>3.6363636363636376<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">Impretive is not that complicated</span>

<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>mapcar #'elk-magic--token-complexity
                        <span style="color: #7fff00;">(</span>elk-parse <span style="color: #00bfff;">(</span>string-trim-left <span style="color: #68f6cb;">"</span>
<span style="color: #68f6cb;">(defun factorial-recursive (n)</span>
<span style="color: #68f6cb;">  (interactive)</span>
<span style="color: #68f6cb;">  (if (zerop n) 1</span>
<span style="color: #68f6cb;">    (* n (factorial-recursive (1- n))))</span>
<span style="color: #68f6cb;">  )"</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Result</span>
<span style="color: #ff8c00;">(</span>2.769230769230769<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">Functional is less complicated!?</span>


<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Very nested</span>
<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>mapcar #'elk-magic--token-complexity
                        <span style="color: #7fff00;">(</span>elk-parse <span style="color: #00bfff;">(</span>string-trim-left <span style="color: #68f6cb;">"</span>
<span style="color: #68f6cb;">(1 (2 (3 (4 (5 (6 (7 (8 (9 (10 (11 (12 (13 (14 (15 (16))))))))))))))))"</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Result</span>
<span style="color: #ff8c00;">(</span>8.5<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">Complicated indeed</span>
</pre>
</div>

<p>
So the results are more encouraging than the previous but again what
does this tell us? I still don't know but here is what I think.
</p>

<ul class="org-ul">
<li><b>If it is around 1 to 5</b>, the code is considered <b>simple</b></li>
<li><b>If it is around 6 to 8</b>, the code is <b>non-trivial</b></li>
<li><b>Anything higher than 8</b>, the code is <b>complex</b></li>
</ul>

<p>
The case may vary and no one can really say if the code should be
complex or simple, that is in experience but having a simple metric is
kinda nice. I do want to say that this metric has its flaws and can be
faked but again it is nice. One can compute the average complexity of
a code and then track it over time or simply get the a static
complexity landscape. Or one can just do an ocular and say this code
needs refactoring. Nothing beats experience I think.
</p>

<p>
Quite encouraging for a simple experiment. I say as well that this
might beat whitespace analysis if people prefer condensed code. I
don't know but for now this is good.
</p>
</div>
</div>
