hacker/_posts/2016-08-27-Analyzing Elisp.org
* Code Manipulation

  If you have the syntax tree then you can manipulate it, right? This is
  the common use of a syntax tree but can also be used as a formatter
  but Elisp already has this. I can give two trivial examples which
  kinda makes this implementing in a more Emacs way fun.

  - Nearest top level expression at point
  - Manipulating the code

  The first one is very easy.

  #+BEGIN_SRC emacs-lisp
    (defun elk-magic--nearest-top-expression-at-point ()
      "Get token expression that is nearest to the highest point"
      (interactive)
      (let* ((source-text (buffer-substring-no-properties (point-min) (point-max)))
             (tokens (elk-parse source-text))
             (expression-token (-first (lambda (token)
                                         (and (= (plist-get token :level) 1)
                                              (eq (plist-get token :type) 'expression)
                                              (<= (plist-get token :start-pos) (point))
                                              (>= (plist-get token :end-pos) (point))))
                                       tokens)))
        (if expression-token
            (goto-char (1+ (plist-get expression-token :start-pos)))
          (message "No near top level expression at point"))))

    ; Complexity: 6.377777777777779 (Non-trivial)
  #+END_SRC

  Just simply parse the code, filter the highest level expressions with
  the ones between the point, and simply point at the =start-pos=. The
  sad thing is that if the code is large this has to parse the whole
  code just to figure out where to land. There is an easier way with
  =paredit=.

  #+BEGIN_SRC emacs-lisp
    (defun paredit--nearest-top-level-expression-at-point ()
      "Above but using paredit"
      (interactive)
      (condition-case ex
          (while t (paredit-backward-up))
        ('error nil)))
    ; Complexity: 2.5(Simple)
  #+END_SRC

  Even, the complexity metric says this. Wow... just goes to show Emacs
  rocks. You don't need the syntax tree just to move around the code.
  But how about something more juicy but not really useful

  Let's say we have this snippet.

  #+BEGIN_SRC emacs-lisp
    (defun x () nil)

    (defvar y nil)
  #+END_SRC

  Nothing special right? Yeah. For the sake of example, how about we
  want to namespace it... say with =z=? Let's use the syntax tree.

  This be way harder than just doing a macro replace, I am not selling
  myself that much huh?

  #+BEGIN_SRC emacs-lisp
    (defun namespacer (namespace)
      (interactive)
      (let* ((source-code (buffer-substring-no-properties (point-min) (point-max)))
          (raw-tokens (elk-parse source-code))
          (token-table (elk-magic--create-token-table raw-tokens))
          (just-tokens (elk-magic--discard-filler raw-tokens))
          (interface-expression-p
           (lambda (expression)
             (let* ((sub-tokens (plist-get expression :tokens))
                 (header-atom (nth 0 sub-tokens))
                 (name-atom (nth 1 sub-tokens))
                 (header-text (plist-get header-atom :text))
                 (name-text (plist-get name-atom :text)))
               (or (string-equal header-text "defun")
                  (string-equal header-text "defvar")))))
          (interface-expressions
           (-filter
            (lambda (token)
              (and (eq (plist-get token :type) 'expression)
                 (= (plist-get token :level) 1)
                 (funcall interface-expression-p token)))
            just-tokens))
          (interace-atoms
           (-map
            (lambda (token)
              (let* ((interface-atom (nth 1 (plist-get token :tokens)))
                  (interface-text (plist-get interface-atom :text))
                  (new-interface-text (concat namespace interface-text)))
                (plist-put interface-atom :text new-interface-text)))
            interface-expressions)))
        (elk--codify raw-tokens)))
    ; Complexity: 7.2065217391304355(Non-trivial?)
  #+END_SRC

  The code is indeed complicated but it works. Applying it to this code
  with =(namespace "my-namespace-")=, would prefix namespacer with
  =my-namespace-namespacer=. I could paste the code but would be merely
  a one line change.

  The sad thing is that you can do this with a macro and probably be
  safer but this shows how you can manipulate the code using the tokens.
  This is more of a PoC than anything else. There is too much boiler
  plate just to change the function name, there might be a better
  paradigm. [[http://esprima.org/][Esprima]] anyone?

