hacker/_posts/2016-08-27-Analyzing Elisp.html

<div id="outline-container-orgfce7a27" class="outline-2">
<h2 id="orgfce7a27">Code Manipulation</h2>
<div class="outline-text-2" id="text-orgfce7a27">
<p>
If you have the syntax tree then you can manipulate it, right? This is
the common use of a syntax tree but can also be used as a formatter
but Elisp already has this. I can give two trivial examples which
kinda makes this implementing in a more Emacs way fun.
</p>

<ul class="org-ul">
<li>Nearest top level expression at point</li>
<li>Manipulating the code</li>
</ul>

<p>
The first one is very easy.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">elk-magic--nearest-top-expression-at-point</span> <span style="color: #ff1493;">()</span>
  <span style="color: #68f6cb; font-style: italic;">"Get token expression that is nearest to the highest point"</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">interactive</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>source-text <span style="color: #ffff00;">(</span>buffer-substring-no-properties <span style="color: #da70d6;">(</span>point-min<span style="color: #da70d6;">)</span> <span style="color: #da70d6;">(</span>point-max<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
         <span style="color: #00bfff;">(</span>tokens <span style="color: #ffff00;">(</span>elk-parse source-text<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
         <span style="color: #00bfff;">(</span>expression-token <span style="color: #ffff00;">(</span>-first <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #00ff7f;">(</span>token<span style="color: #00ff7f;">)</span>
                                     <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">and</span> <span style="color: #ff8247;">(</span>= <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:level</span><span style="color: #9cb6ad;">)</span> 1<span style="color: #ff8247;">)</span>
                                          <span style="color: #ff8247;">(</span>eq <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:type</span><span style="color: #9cb6ad;">)</span> 'expression<span style="color: #ff8247;">)</span>
                                          <span style="color: #ff8247;">(</span>&lt;= <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:start-pos</span><span style="color: #9cb6ad;">)</span> <span style="color: #9cb6ad;">(</span>point<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
                                          <span style="color: #ff8247;">(</span>&gt;= <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:end-pos</span><span style="color: #9cb6ad;">)</span> <span style="color: #9cb6ad;">(</span>point<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span>
                                   tokens<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">if</span> expression-token
        <span style="color: #00bfff;">(</span>goto-char <span style="color: #ffff00;">(</span>1+ <span style="color: #da70d6;">(</span>plist-get expression-token <span style="color: #96a5d9; font-style: italic;">:start-pos</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>message <span style="color: #68f6cb;">"No near top level expression at point"</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Complexity: 6.377777777777779 (Non-trivial)</span>
</pre>
</div>

<p>
Just simply parse the code, filter the highest level expressions with
the ones between the point, and simply point at the <code>start-pos</code>. The
sad thing is that if the code is large this has to parse the whole
code just to figure out where to land. There is an easier way with
<code>paredit</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">paredit--nearest-top-level-expression-at-point</span> <span style="color: #ff1493;">()</span>
  <span style="color: #68f6cb; font-style: italic;">"Above but using paredit"</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">interactive</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">condition-case</span> ex
      <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">while</span> t <span style="color: #00bfff;">(</span>paredit-backward-up<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>'error nil<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Complexity: 2.5(Simple)</span>
</pre>
</div>

<p>
Even, the complexity metric says this. Wow&#x2026; just goes to show Emacs
rocks. You don't need the syntax tree just to move around the code.
But how about something more juicy but not really useful
</p>

<p>
Let's say we have this snippet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">x</span> <span style="color: #ff1493;">()</span> nil<span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defvar</span> <span style="color: #ff694d;">y</span> nil<span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Nothing special right? Yeah. For the sake of example, how about we
want to namespace it&#x2026; say with <code>z</code>? Let's use the syntax tree.
</p>

<p>
This be way harder than just doing a macro replace, I am not selling
myself that much huh?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">namespacer</span> <span style="color: #ff1493;">(</span>namespace<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">interactive</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>source-code <span style="color: #ffff00;">(</span>buffer-substring-no-properties <span style="color: #da70d6;">(</span>point-min<span style="color: #da70d6;">)</span> <span style="color: #da70d6;">(</span>point-max<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>raw-tokens <span style="color: #ffff00;">(</span>elk-parse source-code<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>token-table <span style="color: #ffff00;">(</span>elk-magic--create-token-table raw-tokens<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>just-tokens <span style="color: #ffff00;">(</span>elk-magic--discard-filler raw-tokens<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>interface-expression-p
       <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>expression<span style="color: #da70d6;">)</span>
         <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>sub-tokens <span style="color: #9cb6ad;">(</span>plist-get expression <span style="color: #96a5d9; font-style: italic;">:tokens</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>header-atom <span style="color: #9cb6ad;">(</span>nth 0 sub-tokens<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>name-atom <span style="color: #9cb6ad;">(</span>nth 1 sub-tokens<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>header-text <span style="color: #9cb6ad;">(</span>plist-get header-atom <span style="color: #96a5d9; font-style: italic;">:text</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>name-text <span style="color: #9cb6ad;">(</span>plist-get name-atom <span style="color: #96a5d9; font-style: italic;">:text</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
           <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">or</span> <span style="color: #ff8247;">(</span>string-equal header-text <span style="color: #68f6cb;">"defun"</span><span style="color: #ff8247;">)</span>
              <span style="color: #ff8247;">(</span>string-equal header-text <span style="color: #68f6cb;">"defvar"</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>interface-expressions
       <span style="color: #ffff00;">(</span>-filter
        <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #00ff7f;">(</span>token<span style="color: #00ff7f;">)</span>
          <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">and</span> <span style="color: #ff8247;">(</span>eq <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:type</span><span style="color: #9cb6ad;">)</span> 'expression<span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>= <span style="color: #9cb6ad;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:level</span><span style="color: #9cb6ad;">)</span> 1<span style="color: #ff8247;">)</span>
             <span style="color: #ff8247;">(</span>funcall interface-expression-p token<span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span>
        just-tokens<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>interace-atoms
       <span style="color: #ffff00;">(</span>-map
        <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #00ff7f;">(</span>token<span style="color: #00ff7f;">)</span>
          <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #ff8247;">(</span><span style="color: #9cb6ad;">(</span>interface-atom <span style="color: #ff8c00;">(</span>nth 1 <span style="color: #ff1493;">(</span>plist-get token <span style="color: #96a5d9; font-style: italic;">:tokens</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span>
              <span style="color: #9cb6ad;">(</span>interface-text <span style="color: #ff8c00;">(</span>plist-get interface-atom <span style="color: #96a5d9; font-style: italic;">:text</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span>
              <span style="color: #9cb6ad;">(</span>new-interface-text <span style="color: #ff8c00;">(</span>concat namespace interface-text<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
            <span style="color: #ff8247;">(</span>plist-put interface-atom <span style="color: #96a5d9; font-style: italic;">:text</span> new-interface-text<span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span>
        interface-expressions<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>elk--codify raw-tokens<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #2872b2;">; </span><span style="color: #2872b2;">Complexity: 7.2065217391304355(Non-trivial?)</span>
</pre>
</div>

<p>
The code is indeed complicated but it works. Applying it to this code
with <code>(namespace "my-namespace-")</code>, would prefix namespacer with
<code>my-namespace-namespacer</code>. I could paste the code but would be merely
a one line change.
</p>

<p>
The sad thing is that you can do this with a macro and probably be
safer but this shows how you can manipulate the code using the tokens.
This is more of a PoC than anything else. There is too much boiler
plate just to change the function name, there might be a better
paradigm. <a href="http://esprima.org/">Esprima</a> anyone?
</p>
</div>
</div>
