hacker/_posts/2016-08-27-Analyzing Elisp.org
* Conclusion

  So nothing much to be impressed... for now. I haven't finished the
  book yet but now I have a tool to apply some analysis for Elisp. I'm
  still looking for ideas about analyzing code at face, not by context.
  Code analysis has been done too much, what I am looking at is how code
  can be analyzed as a paragraph or as a poem. Automatic summarization
  and language processing, is there an analogy for code? We have code
  generation and other stuff but how about things that tell you about
  the structure or abstract.

  Maybe I am talking in riddles but I can say this is a fun project
  although will little returns. Hmm... I wonder what else I can analyze
  about the tokens or there proximity.

  I am a writer. I am a coder. I am a writer and a coder
